In [2]:
import numpy as np
import pandas as pd

In [3]:
df = pd.DataFrame([[4, 9]] * 3, columns=['A', 'B'])
df

   A  B
0  4  9
1  4  9
2  4  9

In [4]:
def calc_sum(x):
    return(x.sum())

data = {
  "x": [50, 40, 30],
  "y": [300, 1112, 42]
}

df = pd.DataFrame(data)

x = df.apply(calc_sum)

print(x)

x     120
y    1454
dtype: int64

In [5]:
df.apply(np.cumsum)

     x     y
0   50   300
1   90  1412
2  120  1454

# Reading excel file and performing groupby

In [39]:
df=pd.read_excel('./Fruit.xlsx')
print(df)

        Fruit  Sweetness  Soureness Fruit Type
0       Lemon          1          9       Sour
1   Grapfruit          2          8       Sour
2      Orange          3          7       Sour
3   Raspberry          2          8       Sour
4      Cherry          6          4      Sweet
5      Banana          9          1      Sweet
6      Grapes          8          2      Sweet
7  Watermelon          9          1      Sweet
8     Avacado          1          1        NaN
9  Strawberry          5          5       Sour

In [ ]:
df.groups()
df.groupby

In [20]:
import pandas as pd 
  
# Define a dictionary containing employee data 
data1 = {'Name':['Jai', 'Anuj', 'Jai', 'Princi', 'Gaurav', 'Anuj', 'Princi', 'Abhi'], 
        'Age':[27, 24, 22, 32, 33, 36, 27, 32], 
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj','Jaunpur', 'Kanpur', 'Allahabad', 'Aligarh'], 
        'Qualification':['Msc', 'MA', 'MCA', 'Phd','B.Tech', 'B.com', 'Msc', 'MA']} 
    
# Convert the dictionary into DataFrame  
df = pd.DataFrame(data1)
  
print(df)
grp = df.groupby('Name')
for name, group in grp:
    print(name)
    print(group)
    print()
grp = df.groupby(['Name', 'Qualification'])
for name, group in grp:
    print(name)
    print(group)
    print()
grp = df.groupby('Name')
grp.get_group('Jai')
grp = df.groupby(['Name', 'Qualification'])
grp.get_group(('Jai', 'Msc'))

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1    Anuj   24     Kanpur            MA
2     Jai   22  Allahabad           MCA
3  Princi   32    Kannuaj           Phd
4  Gaurav   33    Jaunpur        B.Tech
5    Anuj   36     Kanpur         B.com
6  Princi   27  Allahabad           Msc
7    Abhi   32    Aligarh            MA
Abhi
   Name  Age  Address Qualification
7  Abhi   32  Aligarh            MA

Anuj
   Name  Age Address Qualification
1  Anuj   24  Kanpur            MA
5  Anuj   36  Kanpur         B.com

Gaurav
     Name  Age  Address Qualification
4  Gaurav   33  Jaunpur        B.Tech

Jai
  Name  Age    Address Qualification
0  Jai   27     Nagpur           Msc
2  Jai   22  Allahabad           MCA

Princi
     Name  Age    Address Qualification
3  Princi   32    Kannuaj           Phd
6  Princi   27  Allahabad           Msc

('Abhi', 'MA')
   Name  Age  Address Qualification
7  Abhi   32  Aligarh            MA

('Anuj', 'B.com')
   Name  Age Address Qualification
5  Anuj   36  Kanpur         B.com

('Anuj', 'MA')
   Name  Age Address Qualification
1  Anuj   24  Kanpur            MA

('Gaurav', 'B.Tech')
     Name  Age  Address Qualification
4  Gaurav   33  Jaunpur        B.Tech

('Jai', 'MCA')
  Name  Age    Address Qualification
2  Jai   22  Allahabad           MCA

('Jai', 'Msc')
  Name  Age Address Qualification
0  Jai   27  Nagpur           Msc

('Princi', 'Msc')
     Name  Age    Address Qualification
6  Princi   27  Allahabad           Msc

('Princi', 'Phd')
     Name  Age  Address Qualification
3  Princi   32  Kannuaj           Phd

  Name  Age Address Qualification
0  Jai   27  Nagpur           Msc

In [ ]:
grp1 = df.groupby('Name')

grp1.aggregate(np.sum)

- crOSSTAB

In [31]:
df=pd.read_excel('survey.xls')
print(df)

      Name Nationality     Sex  Age Handedness
0    Kathy         USA  Female   23      Right
1    Linda         USA  Female   18      Right
2    Peter         USA    Male   19      Right
3     John         USA    Male   22       Left
4   Fatima   Bangadesh  Female   31       Left
5    Kadir   Bangadesh    Male   25       Left
6   Dhaval       India    Male   35       Left
7   Sudhir       India    Male   31       Left
8   Parvir       India    Male   37      Right
9      Yan       China  Female   52      Right
10    Juan       China  Female   58       Left
11   Liang       China    Male   43       Left

In [34]:
pd.crosstab(df.Nationality,df.Age)

Age          18  19  22  23  25  31  35  37  43  52  58
Nationality
Bangadesh     0   0   0   0   1   1   0   0   0   0   0
China         0   0   0   0   0   0   0   0   1   1   1
India         0   0   0   0   0   1   1   1   0   0   0
USA           1   1   1   1   0   0   0   0   0   0   0

In [35]:
pd.crosstab(df.Sex,df.Age)

Age     18  19  22  23  25  31  35  37  43  52  58
Sex
Female   1   0   0   1   0   1   0   0   0   1   1
Male     0   1   1   0   1   1   1   1   1   0   0

In [38]:
pd.crosstab(df.Sex,df.Handedness)

Handedness  Left  Right
Sex
Female         2      3
Male           5      2

# Normalize